<?php
return [
	'platform and contest' => 'Обычные платформы для программирования и конкурсы',
	'detail' => 'Узнать больше',
	'Programming Competition' => 'Конкурс по программированию',
	'Programming Competition Platform' => 'Платформа для конкурсов по программированию',
	'intro of lanqiao' => 'Национальный конкурс по программированию и информационным технологиям «Кубок Ланцяо» (сокращенно «Кубок Ланцяо») — это национальный IT-конкурс, организованный Центром обмена талантами Министерства промышленности и информационных технологий Китая.',
	'intro of acm' => 'Международный студенческий конкурс по программированию ACM (ACM-ICPC) — это ежегодное соревнование, организованное Ассоциацией вычислительной техники (ACM), которое направлено на демонстрацию инновационных способностей студентов, работы в команде и практических навыков в области информатики.',
	'intro of codeforces' => 'Codeforces — это платформа для онлайн-конкурсов по программированию, созданная профессором Майком Мирзаяновым из Саратовского государственного университета в России. Платформа Codeforces предлагает различные конкурсы по программированию, такие как Codeforces Round, Codeforces Global Round, Codeforces Educational Rounds, Codeforces Div. 2 и Codeforces Div. 3.',
	'intro of PKU JudgeOnline' => 'Онлайн-система проверки решений Пекинского университета (PKU JudgeOnline) была разработана факультетом компьютерных наук и технологий Пекинского университета и используется для организации и управления конкурсами по программированию. Система поддерживает несколько языков программирования, включая C, C++, Java и Python, и предлагает функции, такие как отправка кода, просмотр результатов и рейтинги.',
	'intro of Luogu' => 'Luogu — это онлайн-сообщество для изучения программирования, ориентированное на любителей программирования и конкурсов. Luogu предлагает широкий выбор ресурсов по программированию, включая задачи, учебные пособия и соревнования, помогая любителям программирования улучшить свои навыки и уровень подготовки к конкурсам.',
	'intro of Virtual Judge' => 'Virtual Judge — это онлайн-система для оценки программного кода, которая позволяет пользователям отправлять код и тестировать его на правильность и производительность. Virtual Judge поддерживает различные языки программирования, такие как C, C++, Java и Python, и предлагает такие функции, как отправка кода, просмотр результатов и рейтинги. Это полезный инструмент для улучшения навыков программирования и уровня подготовки к соревнованиям.',
	'lanqiao' => 'Кубок Ланцяо',
	'acm' => 'ACM-ICPC',
	'codeforces' => 'Codeforces',
	'PKU JudgeOnline' => 'Онлайн-система Пекинского университета',
	'Luogu' => 'Luogu',
	'Virtual Judge' => 'Virtual Judge',
];
